package ru.otus.shw13;

/*
ДЗ-13: Многопоточная сортировка
Написать приложение, которое сортирует массив чисел в 4 потоках с использованием библиотеки или без нее.
 */

public class Main {

    public static void main(String [] argz){
        System.out.println(Runtime.getRuntime().availableProcessors());
    }

}
