package ru.otus.shw7;

/*
ДЗ 07. Написать эмулятор АТМ
Написать эмулятор АТМ (банкомата).

Объект класса АТМ должен уметь
• принимать банкноты разных номиналов (на каждый номинал должна быть своя ячейка)
• выдавать запрошенную сумму минимальным количеством банкнот или ошибку если сумму нельзя выдать
• выдавать сумму остатка денежных средств
 */

public class Main {
    public static void main(String [] argz){
        System.out.println("ATM test...");
    }
}
